Revit 2024 API
BuiltInFailures.LinkFailures.ModifiedLinkedFile Property
 Shared Sites in the link have been modified, use move instance to reset the change.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId ModifiedLinkedFile { get; }
Visual Basic
Public Shared ReadOnly Property ModifiedLinkedFile As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ ModifiedLinkedFile {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.LinkFailures Class
Autodesk.Revit.DB Namespace